[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:38:28
 };
 
 export const onSuccess = (response) => {
-  if (response.length < 3) {
-    toast(
-      `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
-    );
-  } else {
+  if (response.length < 3) {} else {
     toast(
       `Course ${response[0].enrollCd} replaced old section ${response[2].enrollCd} with new section ${response[1].enrollCd}`,
killedBy: SectionsTable tests onSuccess should display a success message for new course creation
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:50:17
 };
 
 export const onError = (error) => {
-  console.error("onError: error=", error);
+  console.error("", error);
   const message =
     error.response.data?.message ||
killedBy: SectionsTable tests onError should display an error message with the response data
statusReason: expected "error" to be called with arguments: [ 'onError: error=', …(1) ]

Received: 

  1st error call:

@@ -1,7 +1,7 @@
  [

[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:59:38
 
 /* eslint-enable react-refresh/only-export-components*/
 export default function SectionsTable({ sections, schedules = [] }) {
-  if (!(schedules instanceof Array)) {
-    throw new Error("schedules prop must be an array");
-  }
+  if (!(schedules instanceof Array)) {}
 
   if (schedules.length > 0 && !Object.hasOwn(schedules[0], "id")) {
killedBy: SectionsTable tests Section Table tests Error checking that schedules is an array works
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
main/components/Sections/SectionsTable.jsx:63:7
     throw new Error("schedules prop must be an array");
   }
 
-  if (schedules.length > 0 && !Object.hasOwn(schedules[0], "id")) {
+  if (schedules.length <= 0 && !Object.hasOwn(schedules[0], "id")) {
     throw new Error(
       "schedules prop must be an array of objects with an 'id' property",
killedBy: SectionSearchesIndexPageNotLoggedIn tests renders without crashing; SectionSearchesIndexPageLoggedIn tests renders without crashing; SectionsTable tests onError should display an error message with the response data
statusReason: Cannot convert undefined or null to object

[Killed] ArrowFunction
main/components/Sections/SectionsTable.jsx:126:13
     {
       accessorKey: "courseId",
       header: "Course ID",
-      cell: ({ row }) => renderCourseIdLink(row, testid),
+      cell: () => undefined,
     },
     {
killedBy: SectionSearchesIndexPageNotLoggedIn tests calls UCSB section search api correctly with 1 section response; SectionsTable tests Section Table tests Has the expected column headers and content
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  MATH 2A
Received:

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:128:5
       header: "Course ID",
       cell: ({ row }) => renderCourseIdLink(row, testid),
     },
-    {
-      accessorKey: "title",
-      header: "Title",
-    },
+    {},
     {
       header: "Status",
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded; SectionsTable tests onError should display an error message with the response data
statusReason: Columns require an id when using a non-string header
