[Survived] StringLiteral
main/pages/Admin/AdminJobsPage.jsx:24:5
 
   const [sortField, setSortField] = useLocalStorage(
     "JobsSearch.SortField",
-    "status",
+    "",
   );
   const [sortDirection, setSortDirection] = useLocalStorage(
