[Killed] ArrowFunction
src/main/utils/sectionUtils.jsx:105:31
 export const formatInfoLink = (row) =>
   `/coursedetails/${getQuarter(row)}/${getSectionField(row, "enrollCode")}`;
 
-export const renderInfoLink = (row, testid) => (
-  <p align="center">
-    <a
-      href={formatInfoLink(row)}
-      data-testid={`${testid}-row-${row.id}-col-info-link`}
-      target={"_blank"}
-      rel="noopener noreferrer"
-      style={{ color: "black", backgroundColor: "inherit" }}
-    >
-      <FontAwesomeIcon icon={faInfoCircle} />
-    </a>
-  </p>
-);
+export const renderInfoLink = () => undefined;
 
 export const renderCourseIdLink = (row, testid) => {
killedBy: section utils tests renderInfoLink tests renderInfoLink test
statusReason: Cannot read properties of undefined (reading 'props')
