[Killed] EqualityOperator
main/components/Sections/SectionsTable.jsx:38:7
 };
 
 export const onSuccess = (response) => {
-  if (response.length < 3) {
+  if (response.length >= 3) {
     toast(
       `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
killedBy: SectionsTable tests onSuccess should display a success message for new course creation
statusReason: Cannot read properties of undefined (reading 'enrollCd')

[Killed] ArrayDeclaration
main/components/Sections/SectionsTable.jsx:58:63
 };
 
 /* eslint-enable react-refresh/only-export-components*/
-export default function SectionsTable({ sections, schedules = [] }) {
+export default function SectionsTable({ sections, schedules = ["Stryker was here"] }) {
   if (!(schedules instanceof Array)) {
     throw new Error("schedules prop must be an array");
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded
statusReason: schedules prop must be an array of objects with an 'id' property

[Killed] EqualityOperator
main/components/Sections/SectionsTable.jsx:63:7
     throw new Error("schedules prop must be an array");
   }
 
-  if (schedules.length > 0 && !Object.hasOwn(schedules[0], "id")) {
+  if (schedules.length >= 0 && !Object.hasOwn(schedules[0], "id")) {
     throw new Error(
       "schedules prop must be an array of objects with an 'id' property",
killedBy: SectionsTable tests onError should display an error message with the response data; SectionSearchesIndexPageLoggedIn tests renders without crashing
statusReason: Cannot convert undefined or null to object

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:102:26
       cell: ({ row }) =>
         row.getCanExpand() ? (
           <button
-            data-testid={`${testid}-row-${row.index}-expand-button`}
+            data-testid={``}
             {...{
               onClick: row.getToggleExpandedHandler(),
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded; SectionsTable tests Section Table tests Info link is correct
statusReason: Unable to find an element by: [data-testid="SectionsTable-row-0-expand-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"
