[Killed] EqualityOperator
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:41:28
 
   const handleSubmit = (event) => {
     event.preventDefault();
-    const classroomParam = classroom === "ALL" ? "" : classroom;
+    const classroomParam = classroom !== "ALL" ? "" : classroom;
     fetchJSON(event, { Quarter, buildingCode, classroom: classroomParam });
   };
killedBy: CourseOverTimeBuildingsSearchForm tests when I click submit, the right stuff happens
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:41:28
 
   const handleSubmit = (event) => {
     event.preventDefault();
-    const classroomParam = classroom === "ALL" ? "" : classroom;
+    const classroomParam = true ? "" : classroom;
     fetchJSON(event, { Quarter, buildingCode, classroom: classroomParam });
   };
killedBy: CourseOverTimeBuildingsSearchForm tests when I select a specific classroom and submit, it passes the classroom value
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:42:22
   const handleSubmit = (event) => {
     event.preventDefault();
     const classroomParam = classroom === "ALL" ? "" : classroom;
-    fetchJSON(event, { Quarter, buildingCode, classroom: classroomParam });
+    fetchJSON(event, {});
   };
 
killedBy: CourseOverTimeBuildingsSearchForm tests when I click submit, the right stuff happens
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:47:11
 
   useEffect(() => {
     async function fetchClassrooms() {
-      if (Quarter && buildingCode) {
+      if (true) {
         try {
           console.log("Fetching classrooms with:", { Quarter, buildingCode });
killedBy: CourseOverTimeBuildingsSearchForm tests does not fetch classrooms if Quarter or buildingCode is missing
statusReason: expected "wrap" to not be called at all, but actually been called 1 times

Received: 

  1st wrap call:

    Array [
      "/api/public/courseovertime/buildingsearch/classrooms",

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:49:52
     async function fetchClassrooms() {
       if (Quarter && buildingCode) {
         try {
-          console.log("Fetching classrooms with:", { Quarter, buildingCode });
+          console.log("Fetching classrooms with:", {});
           const response = await axios.get(
             "/api/public/courseovertime/buildingsearch/classrooms",
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms if both Quarter and buildingCode exist
statusReason: __vi_import_8__.default.get.mockResolvedValue is not a function

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:61:25
 
           setAvailableClassrooms(classrooms);
         } catch (error) {
-          console.error("Error fetching classrooms", error);
+          console.error("", error);
           setAvailableClassrooms([]);
         }
killedBy: CourseOverTimeBuildingsSearchForm tests handles error when classroom fetch fails
statusReason: __vi_import_8__.default.get.mockRejectedValue is not a function

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:92:14
             />
           </Col>
           <Col md="auto">
-            {availableClassrooms.length > 0 && (
-              <GenericDropdown
-                values={["ALL", ...availableClassrooms]}
-                setValue={setClassroom}
-                controlId={"CourseOverTimeBuildingsSearch.Classroom"}
-                label={"Classroom"}
-              />
-            )}
+            {true}
           </Col>
         </Row>
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Unable to find an element by: [data-testid="CourseOverTimeBuildingsSearch.Classroom-option-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:92:14
             />
           </Col>
           <Col md="auto">
-            {availableClassrooms.length > 0 && (
+            {true && (
               <GenericDropdown
                 values={["ALL", ...availableClassrooms]}
killedBy: CourseOverTimeBuildingsSearchForm tests renders nothing when classrooms is empty
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <select
  class="form-control"
  id="CourseOverTimeBuildingsSearch.Classroom"
>
  <option
    data-testid="CourseOverTimeBuildingsSearch.Classroom-option-0"
