[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:29:5
     "CourseOverTimeBuildingsSearch.BuildingCode",
   );
   const localClassroom = localStorage.getItem(
-    "CourseOverTimeBuildingsSearch.Classroom",
+    "",
   );
 
killedBy: CourseOverTimeBuildingsSearchForm tests reads classroom from localStorage with correct key
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:33:5
   );
 
   const [Quarter, setQuarter] = useState(
-    localQuarter || availableQuarters[0].yyyyq,
+    false,
   );
   const [buildingCode, setBuildingCode] = useState(localBuildingCode || "");
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms if both Quarter and buildingCode exist
statusReason: expected "wrap" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:35:52
   const [Quarter, setQuarter] = useState(
     localQuarter || availableQuarters[0].yyyyq,
   );
-  const [buildingCode, setBuildingCode] = useState(localBuildingCode || "");
+  const [buildingCode, setBuildingCode] = useState(true);
   const [availableClassrooms, setAvailableClassrooms] = useState([]);
   const [classroom, setClassroom] = useState(localClassroom || "ALL");
killedBy: CourseOverTimeBuildingsSearchForm tests does not fetch classrooms if Quarter or buildingCode is missing
statusReason: expected "wrap" to not be called at all, but actually been called 1 times

Received: 

  1st wrap call:

    Array [
      "/api/public/courseovertime/buildingsearch/classrooms",

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:37:46
   );
   const [buildingCode, setBuildingCode] = useState(localBuildingCode || "");
   const [availableClassrooms, setAvailableClassrooms] = useState([]);
-  const [classroom, setClassroom] = useState(localClassroom || "ALL");
+  const [classroom, setClassroom] = useState(true);
 
   const handleSubmit = (event) => {
killedBy: CourseOverTimeBuildingsSearchForm tests when I click submit, the right stuff happens
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:37:46
   );
   const [buildingCode, setBuildingCode] = useState(localBuildingCode || "");
   const [availableClassrooms, setAvailableClassrooms] = useState([]);
-  const [classroom, setClassroom] = useState(localClassroom || "ALL");
+  const [classroom, setClassroom] = useState(false);
 
   const handleSubmit = (event) => {
killedBy: CourseOverTimeBuildingsSearchForm tests when I click submit, the right stuff happens
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Object>, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   Any<Object>,

[Killed] BlockStatement
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:39:35
   const [availableClassrooms, setAvailableClassrooms] = useState([]);
   const [classroom, setClassroom] = useState(localClassroom || "ALL");
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    fetchJSON(event, { Quarter, buildingCode, classroom });
-  };
+  const handleSubmit = (event) => {};
 
   useEffect(() => {
killedBy: CourseOverTimeBuildingsSearchForm tests when I click submit, the right stuff happens; CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:46:11
 
   useEffect(() => {
     async function fetchClassrooms() {
-      if (Quarter && buildingCode) {
+      if (false) {
         try {
           console.log("Fetching classrooms with:", { Quarter, buildingCode });
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Unable to find an element by: [data-testid="CourseOverTimeBuildingsSearch.Classroom-option-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:87:22
               building={buildingCode}
               setBuilding={setBuildingCode}
               controlId={"CourseOverTimeBuildingsSearch.BuildingCode"}
-              label={"Building Name"}
+              label={""}
             />
           </Col>
killedBy: CourseOverTimeBuildingsSearchForm tests when I select a building, the state for building changes; CourseOverTimeBuildingsIndexPage tests calls UCSB Course over time search api correctly with correct response
statusReason: Unable to find a label with the text of: Building Name

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:91:14
             />
           </Col>
           <Col md="auto">
-            {availableClassrooms.length > 0 && (
+            {availableClassrooms.length <= 0 && (
               <GenericDropdown
                 values={["ALL", ...availableClassrooms]}
killedBy: CourseOverTimeBuildingsSearchForm tests fetches classrooms and displays them when quarter and building are selected
statusReason: Unable to find a label with the text of: Classroom

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:91:14
             />
           </Col>
           <Col md="auto">
-            {availableClassrooms.length > 0 && (
+            {availableClassrooms.length >= 0 && (
               <GenericDropdown
                 values={["ALL", ...availableClassrooms]}
killedBy: CourseOverTimeBuildingsSearchForm tests renders nothing when classrooms is empty
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <select
  class="form-control"
  id="CourseOverTimeBuildingsSearch.Classroom"
>
  <option
    data-testid="CourseOverTimeBuildingsSearch.Classroom-option-0"

[Killed] ObjectLiteral
main/components/BasicCourseSearch/CourseOverTimeBuildingsSearchForm.jsx:101:21
             )}
           </Col>
         </Row>
-        <Row style={{ paddingTop: 10, paddingBottom: 10 }}>
+        <Row style={{}}>
           <Col md="auto">
             <Button variant="primary" type="submit">
killedBy: CourseOverTimeBuildingsSearchForm tests Button padding is correct
statusReason: expect(element).toHaveAttribute("style", "padding-top: 10px; padding-bottom: 10px;") // element.getAttribute("style") === "padding-top: 10px; padding-bottom: 10px;"

Expected the element to have attribute:
  style="padding-top: 10px; padding-bottom: 10px;"
Received:
  null
