[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:52:7
     console.error("onError: error=", error);
     // Stryker disable next-line all : Optional chaining creates branch coverage issues that are difficult to fully test
     const message =
-      error?.response?.data?.message ||
-      `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
+      true;
     toast.error(message);
   };
killedBy: SectionsTable tests mutation interactions shows server error message when backend returns message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Course already exists in schedule' ]

Received: 

  1st vi.fn() call:

  [
-   "Course already exists in schedule",

[Timeout] OptionalChaining
main/components/Sections/SectionsTable.jsx:52:7
     console.error("onError: error=", error);
     // Stryker disable next-line all : Optional chaining creates branch coverage issues that are difficult to fully test
     const message =
-      error?.response?.data?.message ||
+      error.response?.data?.message ||
       `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
     toast.error(message);

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:56:7
       `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
     toast.error(message);
   };
-  if (!(schedules instanceof Array)) {
+  if (false) {
     throw new Error("schedules prop must be an array");
   }
killedBy: SectionsTable tests mutation interactions displays a success toast when backend creates a new course
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:120:5
       cell: ({ row }) =>
         row.original.quarter ? yyyyqToQyy(row.original.quarter) : "",
     },
-    {
-      accessorKey: "courseId",
-      header: "Course ID",
-      cell: ({ row }) => renderCourseIdLink(row, testid),
-    },
+    {},
     {
       accessorKey: "title",
killedBy: SectionsTable tests mutation interactions displays a success toast when backend creates a new course
statusReason: Columns require an id when using a non-string header

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:173:13
       header: "Action",
       id: "action",
       cell: ({ row }) => {
-        if (currentUser.loggedIn) {
+        if (true) {
           if (!shouldShowAddToScheduleLink(row)) {
             return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
killedBy: SectionsTable tests mutation interactions displays a success toast when backend creates a new course; SectionsTable when user is not logged in should show not-logged-in span instead of action buttons when user is not logged in
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
