[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:24:41
 import AddToScheduleModal from "main/components/PersonalSchedules/AddToScheduleModal";
 
 export default function SectionsTable({ sections, schedules = [] }) {
-  const objectToAxiosParams = (data) => {
-    return {
-      url: "/api/courses/post",
-      method: "POST",
-      params: {
-        enrollCd: data.enrollCd.toString(),
-        psId: data.psId.toString(),
-      },
-    };
-  };
+  const objectToAxiosParams = (data) => {};
 
   const onSuccess = (response) => {
killedBy: SectionsTable tests mutation interactions displays a success toast when backend creates a new course
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:47:30
     }
   };
 
-  const onError = (error) => {
-    console.error("onError: error=", error);
-    // Stryker disable next-line all : Optional chaining creates branch coverage issues that are difficult to fully test
-    const message =
-      error?.response?.data?.message ||
-      `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
-    toast.error(message);
-  };
+  const onError = (error) => {};
   if (!(schedules instanceof Array)) {
     throw new Error("schedules prop must be an array");
killedBy: SectionsTable tests mutation interactions shows server error message when backend returns message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Course already exists in schedule' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] OptionalChaining
main/components/Sections/SectionsTable.jsx:51:7
     console.error("onError: error=", error);
     // Stryker disable next-line all : Optional chaining creates branch coverage issues that are difficult to fully test
     const message =
-      error?.response?.data?.message ||
+      error?.response?.data.message ||
       `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
     toast.error(message);
killedBy: SectionsTable tests mutation interactions shows server error message when backend returns message
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:55:7
       `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
     toast.error(message);
   };
-  if (!(schedules instanceof Array)) {
+  if (true) {
     throw new Error("schedules prop must be an array");
   }
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded
statusReason: schedules prop must be an array

[Killed] BooleanLiteral
main/components/Sections/SectionsTable.jsx:55:7
       `An unexpected error occurred adding the schedule: ${JSON.stringify(error)}`;
     toast.error(message);
   };
-  if (!(schedules instanceof Array)) {
+  if (schedules instanceof Array) {
     throw new Error("schedules prop must be an array");
   }
killedBy: SectionSearchesIndexPageLoggedIn tests renders without crashing; SectionsTable.loggedOut tests Has the expected cell values when expanded; SectionsTable tests mutation interactions displays a success toast when backend creates a new course
statusReason: schedules prop must be an array

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.jsx:170:5
       id: "info",
       cell: ({ row }) => renderInfoLink(row, testid),
     },
-    {
-      header: "Action",
-      id: "action",
-      cell: ({ row }) => {
-        if (currentUser.loggedIn) {
-          if (!shouldShowAddToScheduleLink(row)) {
-            return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
-          }
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <AddToScheduleModal
-                section={getSection(row)}
-                quarter={getQuarter(row)}
-                onAdd={(section, schedule) =>
-                  addToScheduleCallback(section, schedule, mutation)
-                }
-                schedules={schedules}
-                testid={`${testid}-cell-row-${row.id}-col-action`}
-              />
-            </div>
-          );
-        }
-        return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
-      },
-    },
+    {},
   ];
 
killedBy: SectionsTable.loggedOut tests Has the expected cell values when expanded; SectionsTable tests mutation interactions displays a success toast when backend creates a new course; SectionsTable when user is not logged in should show not-logged-in span instead of action buttons when user is not logged in
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:173:26
     {
       header: "Action",
       id: "action",
-      cell: ({ row }) => {
-        if (currentUser.loggedIn) {
-          if (!shouldShowAddToScheduleLink(row)) {
-            return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
-          }
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <AddToScheduleModal
-                section={getSection(row)}
-                quarter={getQuarter(row)}
-                onAdd={(section, schedule) =>
-                  addToScheduleCallback(section, schedule, mutation)
-                }
-                schedules={schedules}
-                testid={`${testid}-cell-row-${row.id}-col-action`}
-              />
-            </div>
-          );
-        }
-        return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
-      },
+      cell: ({ row }) => {},
     },
   ];
killedBy: SectionsTable tests mutation interactions displays a success toast when backend creates a new course; SectionsTable.loggedOut tests Has the expected cell values when expanded; SectionsTable when user is not logged in should show not-logged-in span instead of action buttons when user is not logged in
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-add-to-schedule-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:174:13
       header: "Action",
       id: "action",
       cell: ({ row }) => {
-        if (currentUser.loggedIn) {
+        if (false) {
           if (!shouldShowAddToScheduleLink(row)) {
             return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
killedBy: SectionsTable tests mutation interactions displays a success toast when backend creates a new course
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-add-to-schedule-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:174:35
       header: "Action",
       id: "action",
       cell: ({ row }) => {
-        if (currentUser.loggedIn) {
-          if (!shouldShowAddToScheduleLink(row)) {
-            return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
-          }
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <AddToScheduleModal
-                section={getSection(row)}
-                quarter={getQuarter(row)}
-                onAdd={(section, schedule) =>
-                  addToScheduleCallback(section, schedule, mutation)
-                }
-                schedules={schedules}
-                testid={`${testid}-cell-row-${row.id}-col-action`}
-              />
-            </div>
-          );
-        }
+        if (currentUser.loggedIn) {}
         return <span data-testid={`${testid}-row-${row.id}-not-logged-in`} />;
       },
killedBy: SectionsTable tests mutation interactions displays a success toast when backend creates a new course
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-add-to-schedule-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] BlockStatement
main/components/Sections/SectionsTable.jsx:175:50
       id: "action",
       cell: ({ row }) => {
         if (currentUser.loggedIn) {
-          if (!shouldShowAddToScheduleLink(row)) {
-            return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
-          }
+          if (!shouldShowAddToScheduleLink(row)) {}
           return (
             <div className="d-flex align-items-center gap-2">
killedBy: SectionsTable tests mutation interactions displays a success toast when backend creates a new course
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
main/components/Sections/SectionsTable.jsx:175:15
       id: "action",
       cell: ({ row }) => {
         if (currentUser.loggedIn) {
-          if (!shouldShowAddToScheduleLink(row)) {
+          if (true) {
             return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
           }
killedBy: SectionsTable tests mutation interactions displays a success toast when backend creates a new course
statusReason: Unable to find an element by: [data-testid="SectionsTable-cell-row-0.1-col-action-add-to-schedule-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table-hover table table-bordered table-hover"
      data-testid="SectionsTable"

[Killed] StringLiteral
main/components/Sections/SectionsTable.jsx:176:39
       cell: ({ row }) => {
         if (currentUser.loggedIn) {
           if (!shouldShowAddToScheduleLink(row)) {
-            return <span data-testid={`${testid}-row-${row.id}-no-action`} />;
+            return <span data-testid={``} />;
           }
           return (
killedBy: SectionsTable tests mutation interactions displays a success toast when backend creates a new course
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
