[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:16:3
   "D",
   "D-",
   "F",
-  "P",
+  "",
   "W",
   "NP",
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:25:6
   1: "Winter",
   2: "Spring",
   3: "Summer",
-  4: "Fall",
+  4: "",
 };
 
killedBy: Grade history tests Has the expected values for one graph
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="grade-history-graphs"
    >

[Killed] MethodExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:59:3
 export const groupDataByQuarterAndInstructor = (data) => {
   const groupedData = {};
 
-  data.sort((a, b) => {
-    const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
-    const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
-
-    if (yearA !== yearB) return yearB - yearA;
-    return qtrB - qtrA;
-  });
+  data;
 
   data.forEach((item) => {
killedBy: groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: expected [ '20094-GONZALEZ T F', …(41) ] to deeply equal [ '20222-LOKSHTANOV D', …(41) ]

[Killed] ConditionalExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:63:9
     const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
     const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
 
-    if (yearA !== yearB) return yearB - yearA;
+    if (true) return yearB - yearA;
     return qtrB - qtrA;
   });
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information; groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/components/GradeHistory/GradeHistoryHelper.jsx:63:9
     const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
     const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
 
-    if (yearA !== yearB) return yearB - yearA;
+    if (yearA === yearB) return yearB - yearA;
     return qtrB - qtrA;
   });
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:69:9
 
   data.forEach((item) => {
     const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) groupedData[key] = [];
+    if (groupedData[key]) groupedData[key] = [];
     groupedData[key].push(item);
   });
killedBy: Grade history tests Has the expected values for one graph
statusReason: Cannot read properties of undefined (reading 'push')
