[Killed] ArrayDeclaration
main/components/GradeHistory/GradeHistoryHelper.jsx:2:26
 // GradeHistoryHelper.js
-export const allGrades = [
-  "A+",
-  "A",
-  "A-",
-  "B+",
-  "B",
-  "B-",
-  "C+",
-  "C",
-  "C-",
-  "D+",
-  "D",
-  "D-",
-  "F",
-  "P",
-  "W",
-  "NP",
-];
+export const allGrades = [];
 
 export const qtrNumToQuarter = {
killedBy: Grade history tests Correctly outputs data for one quarter
statusReason: expected +0 to be 7 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:5:3
 export const allGrades = [
   "A+",
   "A",
-  "A-",
+  "",
   "B+",
   "B",
killedBy: Grade history tests Correctly outputs data for one quarter
statusReason: expected 6 to be 7 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <span
      aria-hidden="true"

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:8:3
   "A-",
   "B+",
   "B",
-  "B-",
+  "",
   "C+",
   "C",
killedBy: Grade history tests Correctly outputs data for one quarter
statusReason: expected 6 to be 7 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <span
      aria-hidden="true"

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:10:3
   "B",
   "B-",
   "C+",
-  "C",
+  "",
   "C-",
   "D+",
killedBy: Grade history tests Correctly outputs data for one quarter
statusReason: expected 6 to be 7 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <span
      aria-hidden="true"

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:12:3
   "C+",
   "C",
   "C-",
-  "D+",
+  "",
   "D",
   "D-",
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:14:3
   "C-",
   "D+",
   "D",
-  "D-",
+  "",
   "F",
   "P",
killedBy: Grade history tests Correctly outputs data for one quarter
statusReason: expected 6 to be 7 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <span
      aria-hidden="true"

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:17:3
   "D-",
   "F",
   "P",
-  "W",
+  "",
   "NP",
 ];
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:23:6
 
 export const qtrNumToQuarter = {
   1: "Winter",
-  2: "Spring",
+  2: "",
   3: "Summer",
   4: "Fall",
killedBy: createCompleteGradeData yyyyqToPrettyStr formats yyyyq into a pretty quarter string
statusReason: expected ' 2022' to be 'Spring 2022' // Object.is equality

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryHelper.jsx:28:44
   4: "Fall",
 };
 
-export const yyyyqToPrettyStr = (yyyyq) => {
-  const [year, qtr] = [yyyyq.slice(0, 4), yyyyq[4]];
-  return `${qtrNumToQuarter[qtr]} ${year}`;
-};
+export const yyyyqToPrettyStr = (yyyyq) => {};
 
 export const formatTooltip = (value, _, props) => {
killedBy: Grade history tests Has the expected values for one graph
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="grade-history-graphs"
    >

[Killed] MethodExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:29:24
 };
 
 export const yyyyqToPrettyStr = (yyyyq) => {
-  const [year, qtr] = [yyyyq.slice(0, 4), yyyyq[4]];
+  const [year, qtr] = [yyyyq, yyyyq[4]];
   return `${qtrNumToQuarter[qtr]} ${year}`;
 };
killedBy: Grade history tests Has the expected values for one graph
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="grade-history-graphs"
    >

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryHelper.jsx:30:10
 
 export const yyyyqToPrettyStr = (yyyyq) => {
   const [year, qtr] = [yyyyq.slice(0, 4), yyyyq[4]];
-  return `${qtrNumToQuarter[qtr]} ${year}`;
+  return ``;
 };
 
killedBy: Grade history tests Has the expected values for one graph
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="grade-history-graphs"
    >

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryHelper.jsx:37:50
   return [`Percentage: ${value.toFixed(1)}%, Count: ${props.payload.count}`];
 };
 
-export const createCompleteGradeData = (data) => {
-  const gradeCounts = data.reduce((acc, item) => {
-    acc[item.grade] = item.count;
-    return acc;
-  }, {});
-
-  const totalCount = Object.values(gradeCounts).reduce(
-    (acc, count) => acc + count,
-    0,
-  );
-
-  return allGrades.map((grade) => ({
-    grade,
-    count: gradeCounts[grade] || 0,
-    percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
-  }));
-};
+export const createCompleteGradeData = (data) => {};
 
 export const groupDataByQuarterAndInstructor = (data) => {
killedBy: Grade history tests Correctly outputs data for one quarter; CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: expected +0 to be 7 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/components/GradeHistory/GradeHistoryHelper.jsx:44:5
   }, {});
 
   const totalCount = Object.values(gradeCounts).reduce(
-    (acc, count) => acc + count,
+    () => undefined,
     0,
   );
killedBy: Grade history tests Correctly outputs data for one quarter; CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: expected +0 to be 7 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <span
      aria-hidden="true"

[Killed] ArrowFunction
main/components/GradeHistory/GradeHistoryHelper.jsx:48:24
     0,
   );
 
-  return allGrades.map((grade) => ({
-    grade,
-    count: gradeCounts[grade] || 0,
-    percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
-  }));
+  return allGrades.map(() => undefined);
 };
 
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information; Grade history tests Correctly outputs data for one quarter
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/GradeHistory/GradeHistoryHelper.jsx:50:12
 
   return allGrades.map((grade) => ({
     grade,
-    count: gradeCounts[grade] || 0,
+    count: gradeCounts[grade] && 0,
     percentage:
       totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
killedBy: createCompleteGradeData calculates grade percentages correctly
statusReason: expected [ { grade: 'A+', …(2) }, …(15) ] to deeply equal [ …(16) ]

[Killed] ConditionalExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:50:12
 
   return allGrades.map((grade) => ({
     grade,
-    count: gradeCounts[grade] || 0,
+    count: true,
     percentage:
       totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
killedBy: createCompleteGradeData calculates grade percentages correctly; CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] ConditionalExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:52:26
     grade,
     count: gradeCounts[grade] || 0,
     percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
+      totalCount > 0 ? ((false) / totalCount) * 100 : 0,
   }));
 };
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information; Grade history tests Correctly outputs data for one quarter
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:52:7
     grade,
     count: gradeCounts[grade] || 0,
     percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
+      true ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
   }));
 };
killedBy: createCompleteGradeData returns zero percentage when total count is zero
statusReason: expected [ …(16) ] to deeply equal [ …(16) ]

[Killed] BlockStatement
main/components/GradeHistory/GradeHistoryHelper.jsx:56:58
   }));
 };
 
-export const groupDataByQuarterAndInstructor = (data) => {
-  const groupedData = {};
-
-  data.sort((a, b) => {
-    const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
-    const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
-
-    if (yearA !== yearB) return yearB - yearA;
-    return qtrB - qtrA;
-  });
-
-  data.forEach((item) => {
-    const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) groupedData[key] = [];
-    groupedData[key].push(item);
-  });
-
-  return groupedData;
-};
+export const groupDataByQuarterAndInstructor = (data) => {};
 
killedBy: Grade history tests renders without crashing for empty graph
statusReason: Cannot convert undefined or null to object

[Killed] ArrayDeclaration
main/components/GradeHistory/GradeHistoryHelper.jsx:60:27
   const groupedData = {};
 
   data.sort((a, b) => {
-    const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
+    const [yearA, qtrA] = [];
     const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
 
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:61:28
 
   data.sort((a, b) => {
     const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
-    const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
+    const [yearB, qtrB] = [b.yyyyq, b.yyyyq[4]];
 
     if (yearA !== yearB) return yearB - yearA;
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:63:9
     const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
     const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
 
-    if (yearA !== yearB) return yearB - yearA;
+    if (false) return yearB - yearA;
     return qtrB - qtrA;
   });
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArithmeticOperator
main/components/GradeHistory/GradeHistoryHelper.jsx:63:33
     const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
     const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
 
-    if (yearA !== yearB) return yearB - yearA;
+    if (yearA !== yearB) return yearB + yearA;
     return qtrB - qtrA;
   });
killedBy: groupDataByQuarterAndInstructor groups data by quarter and instructor correctly
statusReason: expected [ '20094-GONZALEZ T F', …(41) ] to deeply equal [ '20222-LOKSHTANOV D', …(41) ]

[Killed] ConditionalExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:69:9
 
   data.forEach((item) => {
     const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) groupedData[key] = [];
+    if (false) groupedData[key] = [];
     groupedData[key].push(item);
   });
killedBy: Grade history tests Has the expected values for one graph
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
main/components/GradeHistory/GradeHistoryHelper.jsx:69:9
 
   data.forEach((item) => {
     const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) groupedData[key] = [];
+    if (true) groupedData[key] = [];
     groupedData[key].push(item);
   });
killedBy: CourseDetailsIndexPage tests Calls grade history api correctly and displays correct information; Grade history tests Correctly outputs data for one quarter
statusReason: Unable to find an element with the text: Fall 2009 - GONZALEZ T F. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
