[Killed] LogicalOperator
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:57:5
     localEndQuarter || quarters[0].yyyyq,
   );
   const [subject, setSubject] = useState(
-    localSubject || subjects[0]?.subjectCode || defaultSubjectArea,
+    (localSubject || subjects[0]?.subjectCode) && defaultSubjectArea,
   );
   const [courseNumber, setCourseNumber] = useState("");
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /^ANTH$/
Received:
  undefined

[Killed] OptionalChaining
main/components/BasicCourseSearch/CourseOverTimeSearchForm.jsx:135:18
               <Form.Control.Feedback type="invalid">
                 {errors.CourseOverTimeSearchCourseNumber &&
                   "Course Number is required. "}
-                {errors.CourseOverTimeSearchCourseNumber?.type === "pattern" &&
+                {errors.CourseOverTimeSearchCourseNumber.type === "pattern" &&
                   "Course number should be a 1 to 3 digit number, optionally followed by up to two letters."}
               </Form.Control.Feedback>
killedBy: CourseOverTimeSearchForm tests CourseOverTimeSearchForm regular tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')
