[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:51:68
 export const formatTime = (timeLocationArray) => {
   try {
     let res = "";
-    for (let index = 0; index < timeLocationArray.length; index++) {
-      res += convertToTimeRange(
-        hhmmTohhmma(timeLocationArray[index].beginTime),
-        hhmmTohhmma(timeLocationArray[index].endTime),
-      );
-      if (index + 1 < timeLocationArray.length) {
-        res += `, `;
-      }
-    }
+    for (let index = 0; index < timeLocationArray.length; index++) {}
     return res;
   } catch {
killedBy: section utils tests formatTime tests formatTime test 3
statusReason: expected '' to be '3:30 PM - 4:45 PM, 10:30 AM - 11:45 AM' // Object.is equality

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:90:38
 export const formatStatus = (section) => {
   if (section.courseCancelled) {
     return "Cancelled";
-  } else if (section.classClosed === "Y") {
+  } else if (section.classClosed === "") {
     return "Closed";
   } else if (section.enrolledTotal >= section.maxEnroll) {
killedBy: section utils tests formatStatus tests formatStatus closed test
statusReason: expected 'Open' to be 'Closed' // Object.is equality

[Killed] ArrowFunction
src/main/utils/sectionUtils.jsx:105:31
 export const formatInfoLink = (row) =>
   `/coursedetails/${getQuarter(row)}/${getSectionField(row, "enrollCode")}`;
 
-export const renderInfoLink = (row, testid) => (
-  <p style={{ textAlign: "center" }}>
-    <a
-      href={formatInfoLink(row)}
-      data-testid={`${testid}-row-${row.id}-col-info-link`}
-      target={"_blank"}
-      rel="noopener noreferrer"
-      style={{ color: "black", backgroundColor: "inherit" }}
-    >
-      <FontAwesomeIcon icon={faInfoCircle} />
-    </a>
-  </p>
-);
+export const renderInfoLink = () => undefined;
 
 export const renderCourseIdLink = (row, testid) => {
killedBy: section utils tests renderInfoLink tests renderInfoLink test
statusReason: Cannot read properties of undefined (reading 'props')

[Killed] BlockStatement
src/main/utils/sectionUtils.jsx:119:52
   </p>
 );
 
-export const renderCourseIdLink = (row, testid) => {
-  const courseId =
-    row.depth === 0
-      ? row.original.courseId
-      : row.getParentRow().original.courseId;
-
-  return (
-    <a
-      href={formatInfoLink(row)}
-      data-testid={`${testid}-row-${row.id}-col-courseId-link`}
-      target={"_blank"}
-      rel="noopener noreferrer"
-    >
-      {courseId?.replace(/\s+/g, " ").trim()}
-    </a>
-  );
-};
+export const renderCourseIdLink = (row, testid) => {};
 
 export function enrollmentFraction(row) {
killedBy: section utils tests renderCourseIdLink tests renderCourseIdLink test for primary row
statusReason: Cannot read properties of undefined (reading 'props')

[Killed] EqualityOperator
src/main/utils/sectionUtils.jsx:121:5
 
 export const renderCourseIdLink = (row, testid) => {
   const courseId =
-    row.depth === 0
+    row.depth !== 0
       ? row.original.courseId
       : row.getParentRow().original.courseId;
killedBy: section utils tests renderCourseIdLink tests renderCourseIdLink test for primary row
statusReason: row.getParentRow is not a function

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:121:5
 
 export const renderCourseIdLink = (row, testid) => {
   const courseId =
-    row.depth === 0
+    true
       ? row.original.courseId
       : row.getParentRow().original.courseId;
killedBy: section utils tests renderCourseIdLink tests renderCourseIdLink test for subrow
statusReason: expected undefined to be 'MATH 2A' // Object.is equality

[Killed] StringLiteral
src/main/utils/sectionUtils.jsx:129:15
     <a
       href={formatInfoLink(row)}
       data-testid={`${testid}-row-${row.id}-col-courseId-link`}
-      target={"_blank"}
+      target={""}
       rel="noopener noreferrer"
     >
killedBy: section utils tests renderCourseIdLink tests renderCourseIdLink test for primary row
statusReason: expected '' to be '_blank' // Object.is equality

[Killed] MethodExpression
src/main/utils/sectionUtils.jsx:132:8
       target={"_blank"}
       rel="noopener noreferrer"
     >
-      {courseId?.replace(/\s+/g, " ").trim()}
+      {courseId?.replace(/\s+/g, " ")}
     </a>
   );
killedBy: section utils tests renderCourseIdLink tests renderCourseIdLink test for primary row
statusReason: expected 'MATH 2A ' to be 'MATH 2A' // Object.is equality

[Timeout] OptionalChaining
src/main/utils/sectionUtils.jsx:132:8
       target={"_blank"}
       rel="noopener noreferrer"
     >
-      {courseId?.replace(/\s+/g, " ").trim()}
+      {courseId.replace(/\s+/g, " ").trim()}
     </a>
   );
