[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:121:5
 
 export const renderCourseIdLink = (row, testid) => {
   const courseId =
-    row.depth === 0
+    false
       ? row.original.courseId
       : row.getParentRow().original.courseId;
killedBy: section utils tests renderCourseIdLink tests renderCourseIdLink test for primary row
statusReason: row.getParentRow is not a function

[Killed] ConditionalExpression
src/main/utils/sectionUtils.jsx:147:3
 export const isPrimary = (row) => "primary" in row.original;
 
 export const isLectureWithNoSections = (row) =>
-  isPrimary(row) && row.original.subRows.length === 0;
+  true;
 
 export const shouldShowAddToScheduleLink = (row) =>
killedBy: section utils tests tests that depend on what kind of row it is isLectureWithNoSections true test
statusReason: expected true to be false // Object.is equality
